In [1]:
import pandas as pd

names_1881 = pd.read_csv('names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1981 = pd.read_csv('names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))

names_1881.sort_values('count', ascending=False).head()

                count
name    gender
John    M        8769
William M        8524
Mary    F        6919
James   M        5442
George  M        4664

In [5]:
names_1881.shape

(1935, 1)

In [6]:
names_1981.sort_values('count', ascending=False).head()

                    count
name        gender
Michael     M       68728
Jennifer    F       57032
Christopher M       50208
Matthew     M       43311
Jessica     F       42519

In [4]:
names_1881.shape

(1935, 1)

In [8]:
# Reindex names_1981 with index of names_1881: common_names
common_names = names_1981.reindex(names_1881.index)
common_names.head()

                    count
name      gender
Mary      F       11030.0
Anna      F        5182.0
Emma      F         532.0
Elizabeth F       20168.0
Margaret  F        2791.0

In [9]:
# Print shape of common_names
print(common_names.shape)

(1935, 1)

In [10]:
# Drop rows with null counts: common_names
common_names = common_names.dropna()

# Print shape of new common_names
print(common_names.shape)

(1587, 1)

In [11]:
names_1881.reindex()
names_1881.head()

                  count
name      gender
Mary      F        6919
Anna      F        2698
Emma      F        2034
Elizabeth F        1852
Margaret  F        1658

In [12]:
# Add 'year' column to names_1881 and names_1981
names_1881['year'] = 1881
names_1981['year'] = 1981

# Append names_1981 after names_1881 with ignore_index=True: combined_names
combined_names = names_1881.append(names_1981)
combined_names.head()

                  count  year
name      gender
Mary      F        6919  1881
Anna      F        2698  1881
Emma      F        2034  1881
Elizabeth F        1852  1881
Margaret  F        1658  1881

In [13]:
# Print shapes of names_1981, names_1881, and combined_names
print(names_1981.shape)
print(names_1881.shape)
print(combined_names.shape)

(19455, 2)
(1935, 2)
(21390, 2)
        count  year
gender
M          23  1881
F        1769  1981
M         766  1981

In [14]:

# Print all rows that contain the name 'Morgan'
print(combined_names.loc['Morgan'])

        count  year
gender
M          23  1881
F        1769  1981
M         766  1981